uhnp/src/Catalogs/ТН_Уведомления/ТН_Уведомления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТН_Уведомления</name>
  <comment>// Луконин Е.А. 09.04.2026 Выполнение задач №000057338</comment>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>КартинкиУведомления</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокУведомления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
</mdclass:Catalog>

uhnp/src/Catalogs/ТН_Уведомления/ManagerModule.bsl
Функция СоздатьУведомление(Текст, СрокУведомления = Неопределено, Наименование = "") Экспорт
	
	Элемент = СоздатьЭлемент();
	
	Элемент.ДатаСоздания = ТекущаяДатаСеанса();
	Элемент.Содержание = Текст;
	Элемент.Автор = Пользователи.ТекущийПользователь();
	Элемент.СрокУведомления = СрокУведомления;
	Если Не ЗначениеЗаполнено(Наименование) Тогда
		Элемент.Наименование = "Обновление";
	КонецЕсли;
	
	Элемент.Записать();
	
	Возврат Элемент.Ссылка;
	
КонецФункции
